{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "generator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_14"}}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 8192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "dtype": "float32", "target_shape": [8, 8, 128]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_18", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_19", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_20", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_5", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batch_normalization_18/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.043410062789917, "scale": 1.253801233628217e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_18/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.07531420010455168, "scale": 1.7823315056927227e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_18/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_18/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_19/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.016547679901123, "scale": 2.394967105720248e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_19/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.05568655215697171, "scale": 9.1902616072767e-07, "original_dtype": "float32"}}, {"name": "batch_normalization_19/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_19/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_20/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0097488164901733, "scale": 4.564967264233769e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_20/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.03759587313184754, "scale": 6.87549114534254e-07, "original_dtype": "float32"}}, {"name": "batch_normalization_20/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_20/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "conv2d_27/kernel", "shape": [5, 5, 512, 3], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.17669769534077337, "scale": 6.056891486675123e-06, "original_dtype": "float32"}}, {"name": "conv2d_27/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.006345758338769277, "scale": 1.8155637270454558e-07, "original_dtype": "float32"}}, {"name": "conv2d_transpose_18/kernel", "shape": [4, 4, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.1368118002134211, "scale": 4.063676603600591e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_18/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.012436095634342477, "scale": 1.8018104367346389e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_19/kernel", "shape": [4, 4, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.1530314826288658, "scale": 4.0978867456315815e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_19/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.04565679685166414, "scale": 1.0923462653220122e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_20/kernel", "shape": [4, 4, 512, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.21021495094636378, "scale": 5.448100322570009e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_20/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.02200939402196244, "scale": 8.17554846475333e-07, "original_dtype": "float32"}}, {"name": "dense_13/kernel", "shape": [128, 8192], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.0797803628850085, "scale": 2.4825081023433583e-06, "original_dtype": "float32"}}, {"name": "dense_13/bias", "shape": [8192], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.18294041701041472, "scale": 5.392177823279828e-06, "original_dtype": "float32"}}]}]}