{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "generator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_14"}}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 8192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "dtype": "float32", "target_shape": [8, 8, 128]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_18", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_19", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_20", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_5", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_18/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.043410062789917, "scale": 0.00032222691704245174, "original_dtype": "float32"}}, {"name": "batch_normalization_18/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07512170830193687, "scale": 0.00045805919696302973, "original_dtype": "float32"}}, {"name": "batch_normalization_18/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_18/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_19/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.016547679901123, "scale": 0.0006155065461701038, "original_dtype": "float32"}}, {"name": "batch_normalization_19/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05574077470045464, "scale": 0.00023618972330701117, "original_dtype": "float32"}}, {"name": "batch_normalization_19/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_19/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_20/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0097488164901733, "scale": 0.0011731965869080786, "original_dtype": "float32"}}, {"name": "batch_normalization_20/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0376371260787196, "scale": 0.00017670012243530328, "original_dtype": "float32"}}, {"name": "batch_normalization_20/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_20/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "conv2d_27/kernel", "shape": [5, 5, 512, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17745480677660774, "scale": 0.0015566211120755064, "original_dtype": "float32"}}, {"name": "conv2d_27/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.006345758338769277, "scale": 4.665998778506821e-05, "original_dtype": "float32"}}, {"name": "conv2d_transpose_18/kernel", "shape": [4, 4, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1368118002134211, "scale": 0.0010443648871253518, "original_dtype": "float32"}}, {"name": "conv2d_transpose_18/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.012502762620501658, "scale": 0.00046306528224080215, "original_dtype": "float32"}}, {"name": "conv2d_transpose_19/kernel", "shape": [4, 4, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1527077495759609, "scale": 0.0010531568936273164, "original_dtype": "float32"}}, {"name": "conv2d_transpose_19/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04575947740060442, "scale": 0.00028073299018775715, "original_dtype": "float32"}}, {"name": "conv2d_transpose_20/kernel", "shape": [4, 4, 512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21002426743507385, "scale": 0.0014001617829004923, "original_dtype": "float32"}}, {"name": "conv2d_transpose_20/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02206171753213686, "scale": 0.00021011159554416058, "original_dtype": "float32"}}, {"name": "dense_13/kernel", "shape": [128, 8192], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07975057278778039, "scale": 0.0006380045823022431, "original_dtype": "float32"}}, {"name": "dense_13/bias", "shape": [8192], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18292424047694486, "scale": 0.0013857897005829156, "original_dtype": "float32"}}]}]}