{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "generator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_27"}}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 131072, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_16", "trainable": true, "dtype": "float32", "target_shape": [32, 32, 128]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_48", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_78", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_49", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_79", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_50", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_80", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "config": {"name": "conv2d_46", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of35.bin", "group1-shard2of35.bin", "group1-shard3of35.bin", "group1-shard4of35.bin", "group1-shard5of35.bin", "group1-shard6of35.bin", "group1-shard7of35.bin", "group1-shard8of35.bin", "group1-shard9of35.bin", "group1-shard10of35.bin", "group1-shard11of35.bin", "group1-shard12of35.bin", "group1-shard13of35.bin", "group1-shard14of35.bin", "group1-shard15of35.bin", "group1-shard16of35.bin", "group1-shard17of35.bin", "group1-shard18of35.bin", "group1-shard19of35.bin", "group1-shard20of35.bin", "group1-shard21of35.bin", "group1-shard22of35.bin", "group1-shard23of35.bin", "group1-shard24of35.bin", "group1-shard25of35.bin", "group1-shard26of35.bin", "group1-shard27of35.bin", "group1-shard28of35.bin", "group1-shard29of35.bin", "group1-shard30of35.bin", "group1-shard31of35.bin", "group1-shard32of35.bin", "group1-shard33of35.bin", "group1-shard34of35.bin", "group1-shard35of35.bin"], "weights": [{"name": "conv2d_46/kernel", "shape": [5, 5, 512, 3], "dtype": "float32"}, {"name": "conv2d_46/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_48/kernel", "shape": [4, 4, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_48/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_49/kernel", "shape": [4, 4, 256, 128], "dtype": "float32"}, {"name": "conv2d_transpose_49/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_50/kernel", "shape": [4, 4, 512, 256], "dtype": "float32"}, {"name": "conv2d_transpose_50/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_26/kernel", "shape": [256, 131072], "dtype": "float32"}, {"name": "dense_26/bias", "shape": [131072], "dtype": "float32"}]}]}