{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "generator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_27"}}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 32768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_15", "trainable": true, "dtype": "float32", "target_shape": [16, 16, 128]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_55", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_55", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_88", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_56", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_56", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_89", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_57", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_57", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_90", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "batch_normalization_88/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0322227478027344, "scale": 1.2146668984577658e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_88/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.10326188772168156, "scale": 1.974452431627403e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_88/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_88/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_89/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0252279043197632, "scale": 2.269373065939464e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_89/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.03950166286625087, "scale": 6.694289395717677e-07, "original_dtype": "float32"}}, {"name": "batch_normalization_89/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_89/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_90/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0102348327636719, "scale": 4.443920767351848e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_90/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.03134701846906705, "scale": 5.16025786772467e-07, "original_dtype": "float32"}}, {"name": "batch_normalization_90/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_90/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "conv2d_48/kernel", "shape": [5, 5, 512, 3], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.10440830785203892, "scale": 4.474130435894709e-06, "original_dtype": "float32"}}, {"name": "conv2d_48/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.0024973605628984216, "scale": 7.110530615848817e-08, "original_dtype": "float32"}}, {"name": "conv2d_transpose_55/kernel", "shape": [4, 4, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.15092180961578291, "scale": 4.806886314481731e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_55/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.06877466025328467, "scale": 2.317986526905449e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_56/kernel", "shape": [4, 4, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.2794656011485631, "scale": 7.460971277693439e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_56/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.02844607287241518, "scale": 1.246814502406977e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_57/kernel", "shape": [4, 4, 512, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.35984158841056757, "scale": 8.37288755405374e-06, "original_dtype": "float32"}}, {"name": "conv2d_transpose_57/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.018041062221002675, "scale": 6.306961098060715e-07, "original_dtype": "float32"}}, {"name": "dense_26/kernel", "shape": [128, 32768], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.05835446543184945, "scale": 1.8502319487570771e-06, "original_dtype": "float32"}}, {"name": "dense_26/bias", "shape": [32768], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.1621022762593865, "scale": 4.692496056140874e-06, "original_dtype": "float32"}}]}]}