{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "generator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 65536, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [8, 8, 1024]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_8", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_6", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_9", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_7", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_10", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_8", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_11", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "batch_normalization_18/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0283149480819702, "scale": 0.00040584452012005975, "original_dtype": "float32"}}, {"name": "batch_normalization_18/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05326562287176356, "scale": 0.0003673491232535418, "original_dtype": "float32"}}, {"name": "batch_normalization_18/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_18/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_19/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0003684759140015, "scale": 0.0014232747695025277, "original_dtype": "float32"}}, {"name": "batch_normalization_19/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04071054663143906, "scale": 0.00026783254362788855, "original_dtype": "float32"}}, {"name": "batch_normalization_19/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_19/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_20/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0044550895690918, "scale": 0.0008333683013916016, "original_dtype": "float32"}}, {"name": "batch_normalization_20/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.009171759227619451, "scale": 0.00013896604890332502, "original_dtype": "float32"}}, {"name": "batch_normalization_20/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "batch_normalization_20/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0, "scale": 1.0, "original_dtype": "float32"}}, {"name": "conv2d_transpose_10/kernel", "shape": [4, 4, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.41821995202232815, "scale": 0.0027881330134821875, "original_dtype": "float32"}}, {"name": "conv2d_transpose_10/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.009202012945623958, "scale": 0.00013942443857006, "original_dtype": "float32"}}, {"name": "conv2d_transpose_11/kernel", "shape": [4, 4, 3, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13492496650592956, "scale": 0.0010624013110703114, "original_dtype": "float32"}}, {"name": "conv2d_transpose_11/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.006846675183624029, "scale": 1.5578147790887776e-05, "original_dtype": "float32"}}, {"name": "conv2d_transpose_8/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1388699990861556, "scale": 0.001068230762201197, "original_dtype": "float32"}}, {"name": "conv2d_transpose_8/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05346030968369222, "scale": 0.0003686917909220153, "original_dtype": "float32"}}, {"name": "conv2d_transpose_9/kernel", "shape": [4, 4, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.27534267437808657, "scale": 0.001555608329819698, "original_dtype": "float32"}}, {"name": "conv2d_transpose_9/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04125630855560303, "scale": 0.0002696490755268172, "original_dtype": "float32"}}, {"name": "dense_5/kernel", "shape": [100, 65536], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07051692429710836, "scale": 0.0005733083276187672, "original_dtype": "float32"}}, {"name": "dense_5/bias", "shape": [65536], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15101986387196709, "scale": 0.0012798293548471787, "original_dtype": "float32"}}]}]}